api/pkg/stripe/testdata/sub_active.json

{
  "id": "evt_1Rv1oZFNNvjhkCqzAZ7Wyz4z",
  "object": "event",
  "api_version": "2025-01-27.acacia",
  "created": 1754942126,
  "data": {
      "object": {
          "id": "sub_1Rv1oVFNNvjhkCqzI3vgc41P",
          "object": "subscription",
          "application": null,
          "application_fee_percent": null,
          "automatic_tax": {
              "disabled_reason": null,
              "enabled": false,
              "liability": null
          },
          "billing_cycle_anchor": 1754942123,
          "billing_cycle_anchor_config": null,
          "billing_mode": {
              "type": "classic"
          },
          "billing_thresholds": null,
          "cancel_at": null,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "cancellation_details": {
              "comment": null,
              "feedback": null,
              "reason": null
          },
          "collection_method": "charge_automatically",
          "created": 1754942123,
          "currency": "usd",
          "current_period_end": 1757620523,
          "current_period_start": 1754942123,
          "customer": "cus_SqicesZoU7LrDR",
          "days_until_due": null,
          "default_payment_method": "pm_1Rv1oVFNNvjhkCqza28vpwH1",
          "default_source": null,
          "default_tax_rates": [],
          "description": null,
          "discount": null,
          "discounts": [],
          "ended_at": null,
          "invoice_settings": {
              "account_tax_ids": null,
              "issuer": {
                  "type": "self"
              }
          },
          "items": {
              "object": "list",
              "data": [
                  {
                      "id": "si_SqjHcKJTXBnRL6",
                      "object": "subscription_item",
                      "billing_thresholds": null,
                      "created": 1754942124,
                      "current_period_end": 1757620523,
                      "current_period_start": 1754942123,
                      "discounts": [],
                      "metadata": {},
                      "plan": {
                          "id": "price_1Rv198FNNvjhkCqzaaibIbx2",
                          "object": "plan",
                          "active": true,
                          "aggregate_usage": null,
                          "amount": 2000,
                          "amount_decimal": "2000",
                          "billing_scheme": "per_unit",
                          "created": 1754939558,
                          "currency": "usd",
                          "interval": "month",
                          "interval_count": 1,
                          "livemode": false,
                          "metadata": {},
                          "meter": null,
                          "nickname": null,
                          "product": "prod_Sqia5TdP4XGk1x",
                          "tiers_mode": null,
                          "transform_usage": null,
                          "trial_period_days": null,
                          "usage_type": "licensed"
                      },
                      "price": {
                          "id": "price_1Rv198FNNvjhkCqzaaibIbx2",
                          "object": "price",
                          "active": true,
                          "billing_scheme": "per_unit",
                          "created": 1754939558,
                          "currency": "usd",
                          "custom_unit_amount": null,
                          "livemode": false,
                          "lookup_key": "helix-subscription",
                          "metadata": {},
                          "nickname": null,
                          "product": "prod_Sqia5TdP4XGk1x",
                          "recurring": {
                              "aggregate_usage": null,
                              "interval": "month",
                              "interval_count": 1,
                              "meter": null,
                              "trial_period_days": null,
                              "usage_type": "licensed"
                          },
                          "tax_behavior": "unspecified",
                          "tiers_mode": null,
                          "transform_quantity": null,
                          "type": "recurring",
                          "unit_amount": 2000,
                          "unit_amount_decimal": "2000"
                      },
                      "quantity": 1,
                      "subscription": "sub_1Rv1oVFNNvjhkCqzI3vgc41P",
                      "tax_rates": []
                  }
              ],
              "has_more": false,
              "total_count": 1,
              "url": "/v1/subscription_items?subscription=sub_1Rv1oVFNNvjhkCqzI3vgc41P"
          },
          "latest_invoice": "in_1Rv1oVFNNvjhkCqzrdVp2JkZ",
          "livemode": false,
          "metadata": {
              "user_id": "5fcd6135-fbed-41b7-9a55-e3625d3dea75"
          },
          "next_pending_invoice_item_invoice": null,
          "on_behalf_of": null,
          "pause_collection": null,
          "payment_settings": {
              "payment_method_options": {
                  "acss_debit": null,
                  "bancontact": null,
                  "card": {
                      "network": null,
                      "request_three_d_secure": "automatic"
                  },
                  "customer_balance": null,
                  "konbini": null,
                  "sepa_debit": null,
                  "us_bank_account": null
              },
              "payment_method_types": null,
              "save_default_payment_method": "off"
          },
          "pending_invoice_item_interval": null,
          "pending_setup_intent": null,
          "pending_update": null,
          "plan": {
              "id": "price_1Rv198FNNvjhkCqzaaibIbx2",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "amount_decimal": "2000",
              "billing_scheme": "per_unit",
              "created": 1754939558,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "meter": null,
              "nickname": null,
              "product": "prod_Sqia5TdP4XGk1x",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
          },
          "quantity": 1,
          "schedule": null,
          "start_date": 1754942123,
          "status": "active",
          "test_clock": null,
          "transfer_data": null,
          "trial_end": null,
          "trial_settings": {
              "end_behavior": {
                  "missing_payment_method": "create_invoice"
              }
          },
          "trial_start": null
      },
      "previous_attributes": {
          "default_payment_method": null,
          "status": "incomplete"
      }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
      "id": null,
      "idempotency_key": "dad56718-1593-4b60-bbef-039e20ffe6ff"
  },
  "type": "customer.subscription.updated"
}